app/Controllers/Operateur/BaremeController.php

    public function index()
    {
        $typeModel = new TypeOperationModel();
        $baremeModel = new BaremeFraisModel();

        $data['types'] = $typeModel->findAll();

        $db = \Config\Database::connect();
        $data['baremes'] = $db->table('baremes_frais')
                              ->select('baremes_frais.*, types_operation.nom as type_nom')
                              ->join('types_operation', 'types_operation.id = baremes_frais.id_type_operation')
                              ->orderBy('id_type_operation', 'ASC')
                              ->orderBy('montant_min', 'ASC')
                              ->get()
                              ->getResultArray();
---
SELECT `baremes_frais`.*, `types_operation`.`nom` as `type_nom`
FROM `baremes_frais`
JOIN `types_operation` ON `types_operation`.`id` = `baremes_frais`.`id_type_operation`
ORDER BY `id_type_operation` ASC, `montant_min` ASC