app/Controllers/Operateur/OperateurController.php

    public function index()
    {
        $prefixModel = new PrefixeModel();
        $data['prefixes'] = $prefixModel->findAll();
---
SELECT *
FROM `prefixes`

    public function dashboard()
    {
        $db = \Config\Database::connect();
        $data['gains_par_type'] = $db->table('types_operation')
                                    ->select('types_operation.id, types_operation.nom as type_nom, COALESCE(SUM(transactions.frais_appliques), 0.0) as total_frais')
                                    ->join('transactions', 'transactions.id_type_operation = types_operation.id AND transactions.id_statut = 2', 'left')
                                    ->groupBy('types_operation.id')
                                    ->get()
                                    ->getResultArray();
        $gains = $db->table('transactions')
                    ->selectSum('frais_appliques')
                    ->where('id_statut', 2)
                    ->get()
                    ->getRowArray();
        $data['total_gains'] = $gains['frais_appliques'] ?? 0.0;

        $clientModel = new \App\Models\ClientModel();
        $data['clients'] = $clientModel->getClientsWithBalances();

        $data['transactions'] = $db->table('transactions')
                                   ->select('transactions.*, t_op.nom as type_nom, c_src.telephone as source_tel, c_dst.telephone as dest_tel, s_txn.code as statut_code')
                                   ->join('types_operation t_op', 't_op.id = transactions.id_type_operation')
                                   ->join('clients c_src', 'c_src.id = transactions.id_client_source')
                                   ->join('clients c_dst', 'c_dst.id = transactions.id_client_destination', 'left')
                                   ->join('statut_transaction s_txn', 's_txn.id = transactions.id_statut')
                                   ->orderBy('transactions.date_transaction', 'DESC')
                                   ->get()
                                   ->getResultArray();
---
SELECT `types_operation`.`id`, `types_operation`.`nom` as `type_nom`, COALESCE(SUM(transactions.frais_appliques), 0.0) as total_frais
FROM `types_operation`
LEFT JOIN `transactions` ON `transactions`.`id_type_operation` = `types_operation`.`id` AND `transactions`.`id_statut` = 2
GROUP BY `types_operation`.`id`
SELECT SUM(`frais_appliques`) AS `frais_appliques`
FROM `transactions`
WHERE `id_statut` = 2
SELECT `transactions`.*, `t_op`.`nom` as `type_nom`, `c_src`.`telephone` as `source_tel`, `c_dst`.`telephone` as `dest_tel`, `s_txn`.`code` as `statut_code`
FROM `transactions`
JOIN `types_operation` `t_op` ON `t_op`.`id` = `transactions`.`id_type_operation`
JOIN `clients` `c_src` ON `c_src`.`id` = `transactions`.`id_client_source`
LEFT JOIN `clients` `c_dst` ON `c_dst`.`id` = `transactions`.`id_client_destination`
JOIN `statut_transaction` `s_txn` ON `s_txn`.`id` = `transactions`.`id_statut`
ORDER BY `transactions`.`date_transaction` DESC