app/Controllers/Operateur/OperateurController.php

SELECT *
FROM `prefixe_autre`
---
    public function index()
    {
        $prefixeModel      = new PrefixeModel();
        $prefixeAutreModel = new PrefixeAutreModel();

        $data = [
            'prefixes'          => $prefixeModel->findAll(),
            'autres_operateurs' => $prefixeAutreModel->findAll(),
        ];

SELECT *
FROM `prefixe_autre`
WHERE `prefixe` = '032'
 LIMIT 1
---
    public function store_autre()
    {
      $prefixe      = trim((string)$this->request->getPost('prefixe'));
$nomOperateur = trim((string)$this->request->getPost('nom_operateur'));
$pourcentageVal = $this->request->getPost('pourcentage');

if (empty($prefixe) || empty($nomOperateur)) {
    return redirect()->back()->with('error', 'Le préfixe et le nom de l\'opérateur sont obligatoires.');
}

$prefixeAutreModel = new PrefixeAutreModel();

// 1. Vérification doublon sur le préfixe externe
$existant = $prefixeAutreModel->where('prefixe', $prefixe)->first();