app/Models/Operateur/HistoriqueTransfertEtrangerModel.php

SELECT `pa`.`id` as `id_operateur`, `pa`.`nom_operateur`, `pa`.`prefixe`, COALESCE(SUM(hte.montant), 0) as total_brut, COALESCE(comm.pourcentage, 0) as pourcentage_commission, COALESCE(SUM(hte.montant) * (1 - (COALESCE(comm.pourcentage, 0) / 100.0)), 0) as montant_a_envoyer
FROM `prefixe_autre` `pa`
LEFT JOIN `historique_transfert_etranger` `hte` ON `hte`.`id_operateur` = `pa`.`id`
LEFT JOIN (SELECT `c1`.`id_operateur`, `c1`.`pourcentage`
FROM `commission` `c1`
WHERE c1.id = (
                SELECT c2.id 
                FROM commission c2 
                WHERE c2.id_operateur = c1.id_operateur 
                ORDER BY c2.date DESC, c2.id DESC 
                LIMIT 1
            )) comm ON `comm`.`id_operateur` = `pa`.`id`
GROUP BY `pa`.`id`, `pa`.`nom_operateur`, `pa`.`prefixe`, `comm`.`pourcentage`
---
  public function getMontantsAPayerParOperateur(): array
    {
        // Sous-requête pour récupérer la dernière commission par opérateur
        $subQueryCommission = $this->db->table('comission c1')
            ->select('c1.id_operateur, c1.pourcentage')
            ->where('c1.id = (
                SELECT c2.id
                FROM comission c2
                WHERE c2.id_operateur = c1.id_operateur
                ORDER BY c2.date DESC, c2.id DESC
                LIMIT 1
            )', null, false);

        // Requête principale
        return $this->db->table('prefixe_autre pa')
            ->select("
                pa.id as id_operateur,
                pa.nom_operateur,
                pa.prefixe,
                COALESCE(SUM(hte.montant), 0) as total_brut,
                COALESCE(comm.pourcentage, 0) as pourcentage_commission,
                COALESCE(SUM(hte.montant) * (COALESCE(comm.pourcentage, 0) / 100.0), 0) as montant_commission,
                COALESCE(SUM(hte.montant) * (1 - (COALESCE(comm.pourcentage, 0) / 100.0)), 0) as montant_a_envoyer
            ")
            ->join('historique_transfert_etranger hte', 'hte.id_operateur = pa.id', 'left')
            ->join("({$subQueryCommission->getCompiledSelect()}) comm", 'comm.id_operateur = pa.id', 'left')
            ->groupBy('pa.id, pa.nom_operateur, pa.prefixe, comm.pourcentage')
            ->get()
            ->getResultArray();