app/Models/Operateur/PrefixeModel.php

SELECT *
FROM `prefixes`
---
    public function isValidTelephone(string $telephone): bool
    {
        // Nettoyage de la chaîne (enlève les espaces éventuels)
        $telephone = trim($telephone);

        // Récupère la liste de tous les préfixes sous forme de tableau simple : ['033', '037']
        $prefixes = array_column($this->findAll(), 'prefixe');