app/Models/ClientModel.php

SELECT COALESCE(SUM(montant + frais_appliques), 0) as total
FROM `transactions`
WHERE `id_client_source` = 7
AND `id_type_operation` = 2
AND `id_statut` = 2
SELECT COALESCE(SUM(montant + frais_appliques), 0) as total
FROM `transactions`
WHERE `id_client_source` = 7
AND `id_type_operation` = 3
AND `id_statut` = 2
---
    public function getDepot(int $clientId, ?string $date = null): float
    {
        $builder = $this->db->table('transactions')
            ->select('COALESCE(SUM(montant), 0) as total')
            ->where('id_client_source', $clientId)
            ->where('id_type_operation', 1)
            ->where('id_statut', 2);

        if (!empty($date)) {
            $builder->where('date_transaction <=', $date);
        }

        return (float) $builder->get()->getRow()->total;