app/Models/ClientModel.php

    public function findByTelephone($telephone)
    {
        return $this->where('telephone', $telephone)->first();
---
SELECT *
FROM `clients`
WHERE `telephone` = '0330000000'
 LIMIT 1

    public function getOrCreateByTelephone($telephone)
    {
        $telephone = trim((string)$telephone);

        // 1. Recherche du client s'il existe déjà
        $client = $this->findByTelephone($telephone);

        if ($client) {
            return $client;
        }

        // 2. Vérification du préfixe via PrefixeModel
        $prefixeModel = new PrefixeModel();
        if (!$prefixeModel->isValidTelephone($telephone)) {
            throw new \InvalidArgumentException("Le numéro de téléphone doit commencer par un préfixe valide (ex: 033, 037).");
        }

        // 3. Insertion du nouveau client
        $clientId = $this->skipValidation(true)->insert(['telephone' => $telephone]);

        if (!$clientId) {
            throw new \RuntimeException("Impossible d'enregistrer le client en base.");
        }

        // 4. Attribution du statut 'ACTIF' (id = 1 dans votre table statut)
        $statutClientModel = new StatutClientModel();
        $statutClientModel->skipValidation(true)->insert([
            'id_client' => $clientId,
            'id_statut' => 1,
        ]);

        return $this->find($clientId);
---
INSERT INTO `clients` (`telephone`) VALUES ('0330000000')
INSERT INTO `statut_client` (`id_client`, `id_statut`, `date_modification`) VALUES (2, 1, '2026-07-20 14:21:34')
SELECT *
FROM `clients`
WHERE `clients`.`id` = 2

    public function depot(int $clientId, float $montant): bool
    {
        if ($montant <= 0) {
            throw new \InvalidArgumentException("Le montant du dépôt doit être supérieur à 0.");
        }

        // Vérifier que le client existe en base
        $client = $this->find($clientId);
        if (!$client) {
            throw new \InvalidArgumentException("Client introuvable. Veuillez vous reconnecter.");
        }

        $this->db->transBegin();

        $this->db->table('transactions')->insert([
            'reference'             => $this->generateReference(),
            'id_client_source'      => $clientId,
            'id_client_destination' => null,
            'id_type_operation'     => 1, // Dépôt
            'id_statut'             => 2, // SUCCES
            'montant'               => $montant,
            'frais_appliques'       => 0.0,
        ]);
---
INSERT INTO `transactions` (`reference`, `id_client_source`, `id_client_destination`, `id_type_operation`, `id_statut`, `montant`, `frais_appliques`) VALUES ('TXN-20260720-167CCA', 5, NULL, 1, 2, 5000, 0)

    public function getDepot(int $clientId, ?string $date = null): float
    {
        $builder = $this->db->table('transactions')
            ->select('COALESCE(SUM(montant), 0) as total')
            ->where('id_client_source', $clientId)
            ->where('id_type_operation', 1)
            ->where('id_statut', 2);

        if (!empty($date)) {
            $builder->where('date_transaction <=', $date);
        }

        return (float) $builder->get()->getRow()->total;
---
SELECT COALESCE(SUM(montant + frais_appliques), 0) as total
FROM `transactions`
WHERE `id_client_source` = 2
AND `id_type_operation` = 2
AND `id_statut` = 2
SELECT COALESCE(SUM(montant), 0) as total
FROM `transactions`
WHERE `id_client_source` = 2
AND `id_type_operation` = 1
AND `id_statut` = 2

    public function getRetrait(int $clientId, ?string $date = null): float
    {
        $builder = $this->db->table('transactions')
            ->select('COALESCE(SUM(montant + frais_appliques), 0) as total')
            ->where('id_client_source', $clientId)
            ->where('id_type_operation', 2)
            ->where('id_statut', 2);

        if (!empty($date)) {
            $builder->where('date_transaction <=', $date);
        }

        return (float) $builder->get()->getRow()->total;
---
SELECT COALESCE(SUM(montant + frais_appliques), 0) as total
FROM `transactions`
WHERE `id_client_source` = 2
AND `id_type_operation` = 2
AND `id_statut` = 2

    public function getTransfert(int $clientId, ?string $date = null): array
    {
        // 1. Transferts envoyés (montant + frais)
        $builderEnvoi = $this->db->table('transactions')
            ->select('COALESCE(SUM(montant + frais_appliques), 0) as total')
            ->where('id_client_source', $clientId)
            ->where('id_type_operation', 3)
            ->where('id_statut', 2);

        if (!empty($date)) {
            $builderEnvoi->where('date_transaction <=', $date);
        }

        $totalEnvoi = (float) $builderEnvoi->get()->getRow()->total;

        // 2. Transferts reçus (montant brut)
        $builderRecu = $this->db->table('transactions')
            ->select('COALESCE(SUM(montant), 0) as total')
            ->where('id_client_destination', $clientId)
            ->where('id_type_operation', 3)
            ->where('id_statut', 2);

        if (!empty($date)) {
            $builderRecu->where('date_transaction <=', $date);
        }

        $totalRecu = (float) $builderRecu->get()->getRow()->total;
---
SELECT COALESCE(SUM(montant + frais_appliques), 0) as total
FROM `transactions`
WHERE `id_client_source` = 2
AND `id_type_operation` = 3
AND `id_statut` = 2
SELECT COALESCE(SUM(montant), 0) as total
FROM `transactions`
WHERE `id_client_destination` = 2
AND `id_type_operation` = 3
AND `id_statut` = 2

    public function getTransactions(int $clientId): array
    {
        return $this->db->table('transactions t')
            ->select("
                t.*,
                st.code as statut,
                CASE
                    WHEN t.id_type_operation = 3 AND t.id_client_source = {$clientId} THEN 'Transfert envoyé'
                    WHEN t.id_type_operation = 3 AND t.id_client_destination = {$clientId} THEN 'Transfert reçu'
                    ELSE top.nom
                END as operation
            ")
            ->join('types_operation top', 'top.id = t.id_type_operation')
            ->join('statut_transaction st', 'st.id = t.id_statut')
            ->groupStart()
                ->where('t.id_client_source', $clientId)
                ->orWhere('t.id_client_destination', $clientId)
            ->groupEnd()
            ->orderBy('t.date_transaction', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT `t`.*, `st`.`code` as `statut`, CASE 
                    WHEN t.id_type_operation = 3 AND t.id_client_source = 2 THEN 'Transfert envoyé'
                    WHEN t.id_type_operation = 3 AND t.id_client_destination = 2 THEN 'Transfert reçu'
                    ELSE top.nom 
                END as operation
FROM `transactions` `t`
JOIN `types_operation` `top` ON `top`.`id` = `t`.`id_type_operation`
JOIN `statut_transaction` `st` ON `st`.`id` = `t`.`id_statut`
WHERE   (
`t`.`id_client_source` = 2
OR `t`.`id_client_destination` = 2
 )
ORDER BY `t`.`date_transaction` DESC